<template>
	<view class="full">
		<scroll-view scroll-y class="iscrollView">
		<view class="content f-24">
			<view class="t-c m-c f-26 m-b35">用户协议和隐私政策</view>
			<view class="m-b35">
				本平台保护所有用户的个人隐私权。我们将按照本隐私权政策的规定收集、使用或披露您的个人信息。同时，我们会通过本政策向您说明，我们如何为您提供访问、
				更新、控制和保护您信息的服务。您使用或继续使用我们的服务，即意味着同意我们按照本《用户协议和隐私政策》收集、使用、储存和分享您的相关信息。如对本
				政策或相关事宜有任何问题，请通过客服与我们联系。
			</view>
			<ul style="list-style:none;" class="m-b35">
				<li>
					<view class="m-c f-26"> I. 我们可能收集的信息</view>
					<view class="m-b35">
						我们或我们的第三方合作伙伴，可能通过cookies收集和使用您的信息，并将该等信息储存为日志信息。我们使用自己的cookies，目的是为您提供更个性化的用户体验和服务，并用于以下用途：
					</view>
					<view style="margin-left:0.2rem;">
						<ul style="list-style: disc;padding-left: 0.2rem;">
							<li>您的用户名、电子邮件地址和联系偏好设定。
								这使我们能够为您创建帐户，为您提供方便和个性化的帐户访问体验，并提供和支持服务。这些信息也有助于我们就您对服务的使用、产品公告、软件更新等与您进
								行沟通，并响应您的协助请求（包括在您访问帐户遇到困难时提供帐户验证支持）。</li>
							<li>设备或软件信息，例如您的移动设备、网页浏
								览器或用于接入我们服务的其他程序所提供的配置信息、您的移动设备所用的版本和设备硬件信息。我们收集这些信息是为了帮助我们提供和支持服务，包括对您使
								用本软件服务的体验进行本地化处理。此外，还有助于我们更加了解用户是如何使用服务的。</li>
							<li>您使用的本产品和服务的信息。这些信息将帮助我们提供和支持服务，并响应您的协助请求。我们收集这些信息也是为了更好地了解用户如何使用服务。</li>
							<li class="m-b35">您在帐户上添加的任何内容。我们仅为确保您在使用服务时可以获取这些信息而使用这些信息。</li>
						</ul>
					</view>
					<view class="m-b35">
						收集此类信息可以帮助我们管理服务，提供方便和个性化的用户访问体验，提高我们的产品和服务的功能和可用性，分析用户使用服务的趋势和信息，收集服务在特
						定领域的使用和发展信息，并评估软件的内容和结构。我们不会为了向您发送任何有针对性的广告而收集您的信息，也不会追踪您对任何第三方网站的访问。
					</view>
				</li>
				<li>
					<view class="m-c f-26"> II. 我们可能如何收集信息</view>
					<view class="m-b35">
						我们或我们的第三方合作伙伴，可能通过cookies收集和使用您的信息，并将该等信息储存为日志信息。我们使用自己的cookies，目的是为您提供更个性化的用户体验和服务，并用于以下用途：
					</view>
					<view style="margin-left:0.2rem;">
						<ul style="list-style: disc;padding-left: 0.2rem;">
							<li>记住您的身份。例如：有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供的有关您的喜好或其他信息； </li>
							<li class="m-b35">分析您使用我们服务的情况。例如，我们可利用cookies来了解您使用我们的服务进行什么活动，或哪些网页或服务最受您的欢迎；</li>

						</ul>
					</view>
					<view class="m-b35">
						我们或我们的第三方合作伙伴可能通过后台网络请求，上报您的软件使用习惯和使用过程中产生的错误日志，用来改善软件服务。
					</view>
					<view class="m-b35">
						我们会通过询问的方式，得到您的许可后上传软件使用过程中产生的错误日志，用来改善软件服务。
					</view>
				</li>
				<li>
					<view class="m-c f-26">III. 我们可能如何使用信息</view>
					<view class="m-b35">
						我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</view>
					<view style="margin-left:0.2rem;">
						<ul style="list-style: disc;padding-left: 0.2rem;">
							<li>向您提供更精准的服务； </li>
							<li>在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性； </li>
							<li>帮助我们设计新服务，改善我们现有服务； </li>
							<li>使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他用户作出其他方面的回应； </li>
							<li>软件认证或管理软件升级； </li>
							<li class="m-b35">让您参与有关我们产品和服务的调查。</li>

						</ul>
					</view>
					<view class="m-b35">

						为了让您有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某一项服务所收集的信息，以汇集信息或者个性化的
						方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的信息，可能在另一服务中用于向您提供特定内容，或向您展示与您相关的、非普遍推送的信
						息。如果我们在相关服务中提供了相应选项，您也可以授权我们将该服务所提供和储存的信息用于我们的其他服务。
					</view>
				</li>
				<li>
					<view class="m-c f-26">IV. 信息访问，披露和删除</view>
					<view class="m-b35">
						我们仅在本《用户协议和隐私政策》所述目的所必需的期间和法律法规要求的时限内保留您的个人信息。我们不会出售或出租用户信息，我们仅在下列情况下披露信息：</view>
					<view style="margin-left:0.2rem;">
						<ul style="list-style: disc;padding-left: 0.2rem;">
							<li>您明确同意我们分享信息。 </li>
							<li>在遵守严格的数据保护要求的前提下，我们需要与为我们处理数据的关联和非关联服务提供商共享您的信息。 </li>
							<li>我们需要与关联和非关联服务提供商共享您的信息以便满足您的产品或服务要求。 </li>
							<li>我们认为有必要调查对我们的服务条款的潜在违反情况，以贯彻这些服务条款，或者我们认为有必要就针对人身、财产或我们运营服务所用系统的非法活动、涉嫌欺诈的行为或潜在威胁进行调查、预防或采取行动。
							</li>
							<li>我们认定访问、保存或披露信息，是为了保护服务用户的权利、财产或人身安全而依法要求或允许的，或者是为了遵守适用法律而要求的，包括遵守令状、法院指令或其他法律程序的要求。
							</li>
							<li class="m-b35">在适用法律允许的前提下，出于出售或重组全部或部分业务之目的，我们需要分享您的信息。</li>

						</ul>
					</view>
					<view class="m-b35">

						配合我们的服务使用的一些第三方应用程序和服务可能会要求获得访问您的内容或其他帐户信息的权限。为了获得该等访问权限或信息，这些应用程序将通知您并征
						求您的同意。请谨慎考虑您对此类应用程序及服务的选择和您的许可。我们鼓励您阅读各方的用户协议和隐私政策。
					</view>
					<view class="m-b35">

						您可以通过拨打首页的客服电话来注销帐户，注销帐户后，我们将停止为您提供产品或服务，并根据您的要求删除您的个人信息。在以下情形下，您可以向我们提出
						删除个人信息的请求：
					</view>
					<view style="margin-left:0.2rem;">
						<ul style="list-style: disc;padding-left: 0.2rem;">
							<li>如果我们处理个人信息的行为违反法律法规。 </li>
							<li>如果我们收集、使用您的个人信息，却未征得您的同意。 </li>
							<li>如果我们处理个人信息的行为违反了与您的约定。 </li>
							<li>如果您不再使用我们的产品或服务，或您注销了账号。 </li>
							<li>我们认定访问、保存或披露信息，是为了保护服务用户的权利、财产或人身安全而依法要求或允许的，或者是为了遵守适用法律而要求的，包括遵守令状、法院指令或其他法律程序的要求。
							</li>
							<li class="m-b35">如果我们不再为您提供产品或服务。</li>

						</ul>
					</view>
				</li>
				<li>
					<view class="m-c f-26"> V. 本用户协议和隐私政策是否会变更？</view>
					<view class="m-b35">
						随着业务的发展，我们可能需要更新本政策以适应服务、我们的业务和适用于法律的变化；然而，我们将会一直信守尊重您隐私的承诺。</view>
					<view class="m-b35">

						如果适用法律要求，我们将请求您同意此等变更；在其他情况下，请注意，您在任何变更之后继续使用本软件服务帐户即表示您认可并同意遵守新的用户协议和隐私
						政策。如果您不同意本政策的任何变更，且不希望您的信息受修订后政策的约束，您需要关闭您的帐户。
					</view>
				</li>
			</ul>
		</view>
		</scroll-view>
	</view>
</template>

<style lang="scss" scoped>
	.iscrollView {
		height: calc(100vh - 44px);
	}
	.full {
		background: #fff;
	}
	.m-c {
		color: #ef2932;
	}

	.t-c {
		text-align: center;
	}

	.m-b35 {
		margin-bottom: 35rpx;
	}

	.f-26 {
		font-size: 30rpx;
	}

	.f-24 {
		font-size: 26rpx;
	}

	.content {
		display:flex;
		flex-direction:column;
		padding: 40rpx;
		box-sizing: border-box;
		// line-height: 0.75rem;
	}
	ul {
		margin: 0 !important;
		padding: 0 !important;
	}
</style>